Revit 2027 API
CombinableElementArray.Insert Method
Insert the specified element into the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	CombinableElement item,
	int index
)
Public Overridable Sub Insert (
	item As CombinableElement,
	index As Integer
)
public:
virtual void Insert(
	CombinableElement^ item,
	int index
)
abstract Insert :
        item : CombinableElement *
        index : int -> unit
override Insert :
        item : CombinableElement *
        index : int -> unit
Parameters
item CombinableElement
The CombinableElement to be inserted into the array.
index Int32
The CombinableElement will be inserted before this index.
Return Value
Returns whether the CombinableElement was inserted into the array.
See Also
Reference
CombinableElementArray Class
Autodesk.Revit.DB Namespace